In [1]:
import numpy as np
import pandas as pd

## Bad data could be
- Missing data
- Data in wrong format
- Wrong data
- Duplicates

In [4]:
#prepare df
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df1 = df.reindex(index = dates[0:4], columns = list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],['E']] =1
df1

                   A         B         C         D    E
2013-01-01  0.629707 -1.619820  1.551759  0.135648  1.0
2013-01-02 -0.637550 -1.425372 -0.277821 -0.488645  1.0
2013-01-03 -0.598876  0.368745  1.661317  0.080040  NaN
2013-01-04 -0.194870  0.433522  1.648681 -2.509253  NaN

### Missing data
`df.dropna(axis = 0, how = 'any', inplace = False)` -- Drop any rows that have missing data, return a new df<br>
`df.fillna(value = 2, inplace = False)` -- Filling missing data, return a new df<br>
`pd.isna(df)` or `df.isna()` -- To get the boolean mask where values are nan<br>
`df.isna().sum().sum()` -- Count NaN values under the entire df<br>
`df['column'].isna().sum()` -- Count NaN values under a single DataFrame column<br>
`df.iloc[2:].isna().sum().sum()` -- Count NaN values across DataFrame rows<br>
`df.replace(old, new)` <br>
`df.interpolate()` --  By default, performs linear interpolation at missing data points

In [5]:
df1.dropna(how = 'any') # Drop any rows that have missing data

                   A         B         C         D    E
2013-01-01  0.629707 -1.619820  1.551759  0.135648  1.0
2013-01-02 -0.637550 -1.425372 -0.277821 -0.488645  1.0

In [9]:
df1.fillna(value = 2) # Filling missing data.

                   A         B         C         D    E
2013-01-01  0.629707 -1.619820  1.551759  0.135648  1.0
2013-01-02 -0.637550 -1.425372 -0.277821 -0.488645  1.0
2013-01-03 -0.598876  0.368745  1.661317  0.080040  2.0
2013-01-04 -0.194870  0.433522  1.648681 -2.509253  2.0

In [11]:
pd.isna(df1) # To get the boolean mask where values are nan.

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

**Warning!!** Note that pandas/NumPy uses the fact that `np.nan != np.nan`, and treats `None` like `np.nan`.

In [17]:
print(None == None)
print(np.nan == np.nan)

True
False

In [23]:
df1.isnull().any(axis = 1) # check if any row has no values (NULL)
df1.isnull().any(axis = 0) # check if any column has no values(NULL)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [43]:
df1.isna().sum().sum() # count NaN values under the entire df
df1['E'].isna().sum() # count NaN values under a single DataFrame column
df1.iloc[2:].isna().sum().sum() # count NaN values across DataFrame rows

2

In [44]:
df1.interpolate()

                   A         B         C         D    E
2013-01-01  0.629707 -1.619820  1.551759  0.135648  1.0
2013-01-02 -0.637550 -1.425372 -0.277821 -0.488645  1.0
2013-01-03 -0.598876  0.368745  1.661317  0.080040  1.0
2013-01-04 -0.194870  0.433522  1.648681 -2.509253  1.0

In [48]:
# prepare df
d = {"a": list(range(4)), "b": list("ab.."), "c": ["a", "b", np.nan, "d"]}
df2 = pd.DataFrame(d)
df2

   a  b    c
0  0  a    a
1  1  b    b
2  2  .  NaN
3  3  .    d

In [52]:
df2.replace('.', np.nan) #Replace the ‘.’ with NaN
df2.replace(['.', 0], [np.nan, 'b'] ) #Replace a few different values 
df2.replace({'b':'.'}, {'b': 'c'}) # Only search in column 'b'

   a  b    c
0  0  a    a
1  1  b    b
2  2  c  NaN
3  3  c    d

### Data in wrong format
`pd.to_datetime()`

### Wrong data (data filtering)

In [54]:
df1[df1['A']>0]

                   A        B         C         D    E
2013-01-01  0.629707 -1.61982  1.551759  0.135648  1.0

### Duplicates
`df.duplicated()`<br>
`df.drop_duplicates()`<br>

In [60]:
df1['E'].duplicated()
df1.drop_duplicates()

                   A         B         C         D    E
2013-01-01  0.629707 -1.619820  1.551759  0.135648  1.0
2013-01-02 -0.637550 -1.425372 -0.277821 -0.488645  1.0
2013-01-03 -0.598876  0.368745  1.661317  0.080040  NaN
2013-01-04 -0.194870  0.433522  1.648681 -2.509253  NaN